



/**<P>文件注释：HHSortedMap.java</p>
 * <p>作者：何明辉</p>
 * <p>时间：2012-8-8-下午10:31:58</p>
 * <p>类型：文件-HHSortedMap.java</p>
 * <p>用途：该文件用于</p>
 * <p>备注：***</p>
 */
package HHH.HMap;

import java.util.ArrayList;
import java.util.Collection;
import java.util.HashMap;
import java.util.Map.Entry;
import java.util.Set;









/**<P>类型注释：</p>
 * <p>作者：何明辉</p>
 * <p>时间：2012-8-8-下午10:31:58</p>
 * <p>类型：HHSortedMap</p>
 * <p>用途：该类型用于分类统计</p>
 * <p>备注：***</p>
 * @param <T>
 */
public class HSortedMap<T>  {


	private String name="";
	private HashMap<String,ArrayList<T>> map;






	/**<P>函数注释：HHMap</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-8-下午10:28:52</p>
	 * <p>类型：构造函数</p>
	 * <p>用途：该构造函数用于初始化本map</p>
	 * <p>备注：***</p>
	 */
	public HSortedMap() {
		this.map=new HashMap<String,ArrayList<T>>();
	}



	/**
	 * <P>函数注释：getName()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:21</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取name</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public String getName() {
		return this.name;
	}


	/**
	 * <P>函数注释：setName()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:13</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于设置name</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param name
	 */
	public void setName(String name) {
		this.name=name;
	}


	/**
	 * <P>函数注释：containsValue()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:01</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于判断是否含有指定的值</p>
	 * <p>备注：该方法会在全key范围内进行查找</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param arg0
	 *@return
	 */
	public boolean containsValue(Object arg0) {
		boolean real=false;
		Object[] keys=map.keySet().toArray();
		for(Object key:keys){if(map.get(key).contains(arg0)){real=true;break;}}
		return real;
	}


	/**
	 * <P>函数注释：equals()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:31</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法（覆盖/实现）了父类方法</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 * @see java.lang.Object#equals(java.lang.Object)
	 */
	public boolean equals(HSortedMap arg0) {
		if(!this.getName().equals(arg0.getName())){return false;}
		return map.equals(arg0);
	}

	/**
	 * <P>函数注释：get()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:40</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取指定key的list集合</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param name
	 *@return
	 */
	public ArrayList<T> get(String name) {
		return  map.get(name);
	}



	/**
	 * <P>函数注释：hashCode()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:08:57</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法（覆盖/实现）了父类方法</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 * @see java.lang.Object#hashCode()
	 */
	
	@Override
	public int hashCode() {
		return super.hashCode();
	}

	/**
	 * <P>函数注释：isEmpty()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:09:08</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于判断是否为空</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public boolean isEmpty() {
		return map.isEmpty();
	}



	/**
	 * <P>函数注释：set()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:09:16</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于直接设置某个key的数据集</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param name
	 *@param value
	 *@return
	 */
	public ArrayList<T> set(String name, ArrayList<T> value) {
		return map.put(name, value);
	}

	/**
	 * <P>函数注释：put()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:09:39</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于将value存入key下面的list里面</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param name
	 *@param value
	 */
	public void put(String name, T value) {
		ArrayList<T> list=map.get(name);
		if (list == null) {
			list=new ArrayList<T>(10);
			this.set(name, list);
		}
		list.add(value);
	}

	/**
	 * <P>函数注释：count()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:09:46</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于统计指定key下面的元素个数</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param name
	 *@return
	 */
	public int count(String name) {
		return map.get(name).size();
	}


	/**
	 * <P>函数注释：removeData()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:09:56</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于全key范围内删除指定元素</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param object
	 */
	public void removeData(Object object) {
		Object keys[]=map.keySet().toArray();
		for(int i=0;i<keys.length;i++) {
			map.get(keys[i]).remove(object);
		}
	}







	///////////////////////////////////////////////////////       说明          //////////////////////////////////////////////////////
	//||||||||| 时间：2012-8-8 下午11:19:15
	//||||||||| 作者：何明辉
	//||||||||| 用途：以下代码用于
	//||||||||| 备注：
	///////////////////////////////////////////////////////       说明结束          //////////////////////////////////////////////////






	/**
	 * <P>函数注释：clear()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:08</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 */
	public void clear() {
		map.clear();
	}


	/**
	 * <P>函数注释：clear()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:13</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param key
	 */
	public void clear(String key) {
		map.get(key).clear();
	}



	/**
	 * <P>函数注释：clone()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:18</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法（覆盖/实现）了父类方法</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 * @see java.lang.Object#clone()
	 */
	
	@Override
	public HSortedMap clone() {
		HSortedMap map=new HSortedMap();
		map.setName(getName());
		map.map.putAll(this.map);
		return map;
	}







	/**
	 * <P>函数注释：containsKey()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:24</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于判断是否包含指定key</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param key
	 *@return
	 */
	public boolean containsKey(Object key) {
		return map.containsKey(key);
	}







	/**
	 * <P>函数注释：entrySet()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:31</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取entrySet</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public Set<Entry<String,ArrayList<T>>> entrySet() {
		return map.entrySet();
	}







	/**
	 * <P>函数注释：keySet()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:35</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取keySet</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public Set<String> keySet() {
		return map.keySet();
	}








	public void putAll(HSortedMap m) {
		map.putAll(m.map);
	}







	/**
	 * <P>函数注释：remove()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:43</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于移除指定key的数据集</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@param key
	 *@return
	 */
	public ArrayList<T> remove(Object key) {
		return map.remove(key);
	}







	/**
	 * <P>函数注释：size()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:46</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取元素个数</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public int size() {
		return map.size();
	}







	/**
	 * <P>函数注释：toString()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:50</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法（覆盖/实现）了父类方法</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 * @see java.lang.Object#toString()
	 */
	@Override
	public String toString() {
		return map.toString();
	}



	/**
	 * <P>函数注释：toString()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午7:50:42</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于将本对象用指定的连接符字符串化</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 *   略
	 *<p>———————————————————————————————————————————</p>
	 *@param spliter
	 *@return
	 */
	public String toString(String spliter) {
		if(this.isEmpty()){return "{}";}
		Object values[]=this.getValues();
		StringBuilder bu=new StringBuilder();
		bu.append("{");
		for(Object o:values){bu.append(o+spliter);}
		bu.setLength(bu.length()-1);
		bu.append("}");
		return bu.toString();
	}

	/**
	 * <P>函数注释：toString()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午7:51:19</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于指示是否将本对象用大括号字符串化</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 *   略
	 *<p>———————————————————————————————————————————</p>
	 *@param keepbrackets
	 *@return
	 */
	public String toString(boolean keepbrackets) {
		if(this.isEmpty()){return keepbrackets?"{}":"";}
		Object values[]=this.getValues();
		StringBuilder bu=new StringBuilder();
		if(keepbrackets)bu.append("{");
		for(Object o:values){bu.append(o+",");}
		bu.setLength(bu.length()-1);
		if(keepbrackets)bu.append("}");
		return bu.toString();
	}

	/**
	 * <P>函数注释：toString()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午7:52:42</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于将本对象用指定的连接符字符串化，同时可配是否需要大括号</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 *   略
	 *<p>———————————————————————————————————————————</p>
	 *@param keepbrackets
	 *@param spliter
	 *@return
	 */
	public String toString(boolean keepbrackets,String spliter) {
		if(this.isEmpty()){return keepbrackets?"{}":"";}
		Object values[]=this.getValues();
		StringBuilder bu=new StringBuilder();
		if(keepbrackets)bu.append("{");
		for(Object o:values){bu.append(o+spliter);}
		bu.setLength(bu.length()-1);
		if(keepbrackets)bu.append("}");
		return bu.toString();
	}




	/**
	 * <P>函数注释：values()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:10:54</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于获取values</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 * 
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public Collection<ArrayList<T>> values() {
		return map.values();
	}




	/**
	 * <P>函数注释：getKeys()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:05:37</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于取得所有的key</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 *   略
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public Object[] getKeys(){
		return map.keySet().toArray();
	}


	/**
	 * <P>函数注释：getValues()</p>
	 *<p>———————————————————————————————————————————</p>
	 * <p>作者：何明辉</p>
	 * <p>时间：2012-8-12-下午8:05:55</p>
	 * <p>类型：方法</p>
	 * <p>用途：该方法用于取得所有的value</p>
	 * <p>备注：***</p>
	 * <p>抛出异常：[]</p>
	 * <p>触发事件：[]</p>
	 * <p>示例：</p>
	 *<p>———————————————————————————————————————————</p>
	 *   略
	 *<p>———————————————————————————————————————————</p>
	 *@return
	 */
	public Object[] getValues() {
		return map.values().toArray();
	}






}
